controllers/ImController.php

SELECT * FROM `vcos_im_member` WHERE `member_id`='E19072179'
---
	public function actionRegister()
	{
		$member_id = isset($_POST['member_id']) ? $_POST['member_id'] : '';
		$name = isset($_POST['name']) ? $_POST['name'] : '';
		$signature = isset($_POST['signature']) ? $_POST['signature'] : '';
		$icon = isset($_POST['icon']) ? $_POST['icon'] : '';
		$response = array();
		if(!empty($member_id) && !empty($name) && !empty($icon))
		{
			$imMember = ImMember::find()->where(['member_id' => $member_id])->one();

SELECT * FROM `vcos_im_group_member` WHERE (`member_id`='K02284695') AND (`group_id`='156')
INSERT INTO `vcos_im_group_member` (`member_id`, `member_group_name`, `group_id`) VALUES ('K02284695', '黄振强', 156)
---
	public function actionJoingroup()
	{
		$member_id = isset($_POST['member_id']) ? $_POST['member_id'] : '';
		$member_group_name = isset($_POST['member_group_name']) ? $_POST['member_group_name'] : '';
		$group_id = isset($_POST['group_id']) ? $_POST['group_id'] : '';

		$response = array();
		if(!empty($member_id) && !empty($member_group_name) && !empty($group_id))
		{
			$m_group = ImGroupMember::find()->where(['member_id'=>$member_id,'group_id'=>$group_id])->all();
			if(empty($m_group)){
				$imGroupMember = new ImGroupMember();
				$imGroupMember->member_id=$member_id;
				$imGroupMember->member_group_name=$member_group_name;
				$imGroupMember->group_id=$group_id;
				$result = $imGroupMember->save();

SELECT * FROM `vcos_im_group_member` WHERE (`member_id`='K02284695') AND (`group_id`='296')
---
	public function actionQuitgroup()
	{
		$member_id = isset($_POST['member_id']) ? $_POST['member_id'] : '';
// 		$member_group_name = isset($_POST['member_group_name']) ? $_POST['member_group_name'] : '';
		$group_id = isset($_POST['group_id']) ? $_POST['group_id'] : '';
		$response = array();
		if(!empty($member_id) && !empty($group_id))
		{
			$imGroupMember =ImGroupMember::find()->where(['member_id'=>$member_id,'group_id'=>$group_id])->one();