controllers/MallController.php

					$productComment->is_add_comment = $is_add_comment;
					$productComment->reply_content = $reply_content;
					$productComment->reply_create_time = $reply_create_time;
					$productComment->save ();
---
INSERT INTO `vcos_product_comment` (`comment_type`, `product_id`, `comment_content`, `crater_time`, `member_code`, `member_name`, `order_serial_num`, `score`, `url_img1`, `url_img2`, `url_img3`, `url_img4`, `is_upload_img`, `is_add_comment`, `reply_content`, `reply_create_time`) VALUES (1, 19, '', '2016-02-22 08:39:04', '010000015759', '邹峰', 'CM2016300958533983', 2, '', '', '', '', 0, 0, '回复1', '2016-02-22 08:39:04')