controllers/OrderController.php

	public static function actionCancelorder()
	{
		$sign = isset($_POST['sign']) ? $_POST['sign'] : '';
		$order_serial_num = isset($_POST['order_serial_num']) ? $_POST['order_serial_num'] : '';
		$remark = isset($_POST['remark']) ? $_POST['remark'] : '';

		$response = array();
		if(!empty($sign) && !empty($order_serial_num)){
			$member = MemberService::getMemberbysign($sign);
			if(!empty($member)){
				$order = MemberOrder::find()->where(['order_serial_num' => $order_serial_num,'membership_code'=>$member->member_code,'order_status'=>0])->one();
				if(!empty($order)){
					$order->order_status = 4;
					$order->remark =$remark;
					$count = $order->save();
---
SELECT * FROM `vcos_member_order` WHERE (`order_serial_num`='CM2016304514179986') AND (`membership_code`='010000015759') AND (`order_status`=0)
UPDATE `vcos_member_order` SET `order_status`=4, `user_operation`=4, `remark`='我不想买了' WHERE `order_id`=56