components/MemberService.php

	public static function getMemberbysign($sign) {
		$member = Member::find ()->select ( [
				'member_id',
				'smart_card_number',
				'member_code',
				'member_name',
				'cn_name',
				'passport_number',
				'member_password',
				'member_email',
				'mobile_number',
				'member_money',
				'member_credit',
				'overdraft_limit',
				'curr_overdraft_amount',
				'sign'
		] )->where ( [
				'sign' => $sign
		] )->one ();
---
SELECT `member_id`, `smart_card_number`, `member_code`, `member_name`, `cn_name`, `passport_number`, `member_password`, `member_email`, `mobile_number`, `member_money`, `member_credit`, `overdraft_limit`, `curr_overdraft_amount`, `sign` FROM `vcos_member` WHERE `sign`='684ac1a92487017d36218f1c5722fece'

	public static function memberCardpay ( $code_or_passport,$order_num, $passwd,$datas) {
		// $amount 商品价格
		$response = array ();
		if (self::checkMembershipCode ( $code_or_passport )) {
			$member = Member::find ()->select ([
					'member_money',
					'member_code',
					'passport_number',
					'member_password',
					'overdraft_limit',
					'curr_overdraft_amount'
			])->where ([
					'member_code' => $code_or_passport
			])->one ();
---
SELECT `member_money`, `member_code`, `passport_number`, `member_password`, `overdraft_limit`, `curr_overdraft_amount` FROM `vcos_member` WHERE `member_code`='010000000203'

	public static function goodsreturn($code_or_passport,$order_num,$data_array)
	{
		$response = array ();
		if (self::checkMembershipCode ( $code_or_passport )) {
			$member = Member::find ()->select ( [
					'member_money',
					'member_code',
					'passport_number',
					'member_password',
					'overdraft_limit',
					'curr_overdraft_amount'
			] )->where ( [
					'member_code' => $code_or_passport
			] )->one ();
		} else {
			$member = Member::find ()->select ( [
					'member_money',
					'member_code',
					'passport_number',
					'member_password',
					'overdraft_limit',
					'curr_overdraft_amount'
			] )->where ( [
					'passport_number' => $code_or_passport
			] )->one ();
---
SELECT `member_money`, `member_code`, `passport_number`, `member_password`, `overdraft_limit`, `curr_overdraft_amount` FROM `vcos_member` WHERE `member_code`='010000000203'