components/OrderService.php

	public static function getBookingno(){
		$booking_no = OrderService::createOrderno();
		$booking_count = MemberBooking::find()->where(['booking_no' => $booking_no])->count();
---
SELECT COUNT(*) FROM `vcos_member_booking` WHERE `booking_no`='CI2016835925914872'

	public static function getMemberOrderNO()
	{
		$order_serial_num = OrderService::createOrderno();
		$order_count = MemberOrder::find()->where(['order_serial_num' => $order_serial_num])->count();
---
SELECT COUNT(*) FROM `vcos_member_order` WHERE `order_serial_num`='CM2016304514179986'

	public static function getOrderCheckNum($order_check_num){
		$member_order = MemberOrder::find()->where(['order_check_num' => $order_check_num])->one();
---
SELECT * FROM `vcos_member_order` WHERE `order_check_num`='b8582e44cd1334c76d9532cd8bd35911'

		$memberOrder->store_name = $shop[0]['shop_title'];
		$memberOrder->receiving_way = $receiving_way;
		$memberOrder->consignee_address = $address;
		$memberOrder->save();
---
INSERT INTO `vcos_member_order` (`order_serial_num`, `membership_code`, `totale_price`, `pay_type`, `order_create_time`, `order_type`, `order_check_num`, `store_id`, `store_name`, `receiving_way`, `consignee_address`) VALUES ('CM2016304514179986', '010000015759', 12900, 3, '2016-02-22 08:40:51', 2, 'b8582e44cd1334c76d9532cd8bd35911', 21, '西西小可', 2, '(null)F-(null)')

			$memberOrderDetail->buy_num = $goods_item['buy_num'];
			$memberOrderDetail->last_change_time =  $curr_time;

			$memberOrderDetail->save();
---
INSERT INTO `vcos_member_order_detail` (`order_serial_num`, `goods_id`, `goods_name`, `goods_img_url`, `goods_price`, `standard_price`, `buy_num`, `last_change_time`) VALUES ('CM2016304514179986', 19, '豆乳美肌保湿乳液', 'product_images/201511/201511051357377381.png', 12900, 35000, 1, '2016-02-22 08:40:51')